# Assignment 18. SQL basic-3

In [1]:
!pip install ipython-sql

%load_ext sql

!env | grep POST

import os
USER = os.environ['POSTGRESQL_USER']
PASSWORD = os.environ['POSTGRESQL_PASSWORD']
POSTGRESQL_HOST = '10.129.0.25'
DBASE_NAME = 'demo'

CONNECT_DATA = 'postgresql://{}:{}@{}/{}'.format(
    USER,
    PASSWORD,
    POSTGRESQL_HOST,
    DBASE_NAME
)

Requirement already satisfied: ipython-sql in /opt/conda/lib/python3.10/site-packages (0.5.0)
Requirement already satisfied: ipython-genutils in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: ipython in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (8.11.0)
Requirement already satisfied: six in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: sqlparse in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: prettytable in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (3.7.0)
Requirement already satisfied: sqlalchemy>=2.0 in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (2.0.7)
Requirement already satisfied: greenlet!=0.4.17 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: typing-extensions>=4.2.0 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: matplotlib-inline in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pygments>=2.4.0 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (2.14.0)
Requirement already satisfied: traitlets>=5 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.9.0)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (3.0.38)
Requirement already satisfied: decorator in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: pickleshare in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: pexpect>4.3 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: jedi>=0.16 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.18.2)
Requirement already satisfied: stack-data in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.6.2)
Requirement already satisfied: backcall in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: wcwidth in /opt/conda/lib/python3.10/site-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /opt/conda/lib/python3.10/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /opt/conda/lib/python3.10/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: asttokens>=2.1.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (2.2.1)
Requirement already satisfied: pure-eval in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: executing>=1.2.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (1.2.0)
WARNING: There was an error checking the latest version of pip.
POSTGRESQL_USER=reader
POSTGRESQL_PASSWORD=Miba2021

1. Output a list of tickets, where number of flights>3

In [10]:
%%sql $CONNECT_DATA
Select ticket_no, Count(flight_id) AS number_of_flights
From Ticket_flights
Group by ticket_no
Having Count(flight_id) > 3 Limit 10

10 rows affected.

[('0005432312163', 4),
 ('0005432312164', 4),
 ('0005432312165', 4),
 ('0005432312166', 4),
 ('0005432312167', 4),
 ('0005432312168', 4),
 ('0005432312169', 4),
 ('0005432312170', 4),
 ('0005432312171', 4),
 ('0005432312172', 4)]

2. Output a total number of tickets which have exactly 5 flights. Just one number, nothing else.

In [25]:
%%sql $CONNECT_DATA
Select Count(*)
From (
    Select ticket_no
    From Ticket_flights
    Group by ticket_no
    Having Count(flight_id) = 5
) AS tickets_with_5_flights

1 rows affected.

[(54,)]

3.Create and fill 2 tables exactly like those below (you will need this script in the exam as well).

In [1]:
!pip install ipython-sql

%load_ext sql

!env | grep POST

import psycopg2

with psycopg2.connect(
    dbname='jovyan'
) as conn:
    with conn.cursor() as cur:
        cur.execute('SELECT datname FROM pg_database')
        records = cur.fetchall()

Requirement already satisfied: ipython-sql in /opt/conda/lib/python3.10/site-packages (0.5.0)
Requirement already satisfied: six in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: sqlalchemy>=2.0 in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (2.0.7)
Requirement already satisfied: ipython in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (8.11.0)
Requirement already satisfied: ipython-genutils in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (3.7.0)
Requirement already satisfied: sqlparse in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: typing-extensions>=4.2.0 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: greenlet!=0.4.17 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: pickleshare in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=5 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.9.0)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (3.0.38)
Requirement already satisfied: decorator in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.18.2)
Requirement already satisfied: stack-data in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.6.2)
Requirement already satisfied: pexpect>4.3 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: backcall in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pygments>=2.4.0 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (2.14.0)
Requirement already satisfied: wcwidth in /opt/conda/lib/python3.10/site-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /opt/conda/lib/python3.10/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /opt/conda/lib/python3.10/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: asttokens>=2.1.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (2.2.1)
Requirement already satisfied: executing>=1.2.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (1.2.0)
Requirement already satisfied: pure-eval in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
WARNING: There was an error checking the latest version of pip.
POSTGRESQL_USER=reader
POSTGRESQL_PASSWORD=Miba2021

In [9]:
%%sql postgresql:///jovyan
CREATE TABLE employees (
    employee_id text NOT NULL,
    first_name text NOT NULL, 
    last_name text NOT NULL, 
    hire_date date NOT NULL,
    job_id text NOT NULL,
    manager_id text NOT NULL,
    department_id text NOT NULL
);

INSERT INTO employees VALUES ('100', 'Steven', 'King', '1987-06-17', 'AD_PRES', '0', '90');
INSERT INTO employees VALUES ('101', 'Neena', 'Kochhar', '1987-06-18', 'AD_VP', '100', '90');
INSERT INTO employees VALUES ('102', 'Lex', 'DeHaan', '1987-06-19', 'AD_VP', '100', '90');
INSERT INTO employees VALUES ('103', 'Alexander', 'Hunold', '1987-06-20', 'IT_PROG', '102', '60');
INSERT INTO employees VALUES ('107', 'Diana', 'Lorents', '1987-06-24', 'IT_ProG', '103', '60');
INSERT INTO employees VALUES ('108', 'Nancy', 'Greenberg', '1987-06-25', 'FI_MGR', '101', '100');
INSERT INTO employees VALUES ('109', 'Daniel', 'Faviet', '1987-06-26', 'FI_ACCOUNT', '108', '100');
INSERT INTO employees VALUES ('114', 'Den', 'Raphaely', '1987-07-01', 'PU_MAN', '100', '30');
INSERT INTO employees VALUES ('118', 'Guy', 'Himuro', '1987-07-05', 'PU_CLERK', '114', '30');
INSERT INTO employees VALUES ('144', 'Peter', 'Vargas', '1987-07-31', 'ST_CLERK', '114', '50');
INSERT INTO employees VALUES ('145', 'John', 'Russell', '1987-08-01', 'SA_MAN', '100', '80');
INSERT INTO employees VALUES ('146', 'Karen', 'Partners', '1987-08-02', 'SA_MAN', '100', '80')

Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [10]:
%%sql postgresql:///jovyan
SELECT *
FROM employees

12 rows affected.

[('100', 'Steven', 'King', datetime.date(1987, 6, 17), 'AD_PRES', '0', '90'),
 ('101', 'Neena', 'Kochhar', datetime.date(1987, 6, 18), 'AD_VP', '100', '90'),
 ('102', 'Lex', 'DeHaan', datetime.date(1987, 6, 19), 'AD_VP', '100', '90'),
 ('103', 'Alexander', 'Hunold', datetime.date(1987, 6, 20), 'IT_PROG', '102', '60'),
 ('107', 'Diana', 'Lorents', datetime.date(1987, 6, 24), 'IT_ProG', '103', '60'),
 ('108', 'Nancy', 'Greenberg', datetime.date(1987, 6, 25), 'FI_MGR', '101', '100'),
 ('109', 'Daniel', 'Faviet', datetime.date(1987, 6, 26), 'FI_ACCOUNT', '108', '100'),
 ('114', 'Den', 'Raphaely', datetime.date(1987, 7, 1), 'PU_MAN', '100', '30'),
 ('118', 'Guy', 'Himuro', datetime.date(1987, 7, 5), 'PU_CLERK', '114', '30'),
 ('144', 'Peter', 'Vargas', datetime.date(1987, 7, 31), 'ST_CLERK', '114', '50'),
 ('145', 'John', 'Russell', datetime.date(1987, 8, 1), 'SA_MAN', '100', '80'),
 ('146', 'Karen', 'Partners', datetime.date(1987, 8, 2), 'SA_MAN', '100', '80')]

In [11]:
%%sql postgresql:///jovyan
CREATE TABLE departments (
    department_id text NOT NULL,
    department_name text NOT NULL, 
    manager_id text NULL
);

INSERT INTO departments VALUES ('10', 'Administration', '200');
INSERT INTO departments VALUES ('30', 'Purchasing', '114');
INSERT INTO departments VALUES ('40', 'HumanResources', '203');
INSERT INTO departments VALUES ('50', 'Shipping', '121');
INSERT INTO departments VALUES ('60', 'IT', '103');
INSERT INTO departments VALUES ('70', 'PublicRelations', '204');
INSERT INTO departments VALUES ('80', 'Sales', '145');
INSERT INTO departments VALUES ('90', 'Executive', '100');
INSERT INTO departments VALUES ('100', 'Finance', '108');
INSERT INTO departments VALUES ('110', 'Accounting', '205')

Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [12]:
%%sql postgresql:///jovyan
SELECT * 
FROM departments

10 rows affected.

[('10', 'Administration', '200'),
 ('30', 'Purchasing', '114'),
 ('40', 'HumanResources', '203'),
 ('50', 'Shipping', '121'),
 ('60', 'IT', '103'),
 ('70', 'PublicRelations', '204'),
 ('80', 'Sales', '145'),
 ('90', 'Executive', '100'),
 ('100', 'Finance', '108'),
 ('110', 'Accounting', '205')]

In [13]:
%%sql postgresql:///jovyan
SELECT tablename AS table FROM pg_tables WHERE tablename !~ '^(pg_|sql_)'

3 rows affected.

[('writers',), ('employees',), ('departments',)]

Write a query: output the Department_name which has the longest-working employee in the company, together with the First_name + Last_name of this employee.

In [20]:
%%sql postgresql:///jovyan
Select Department_name, First_name, Last_name
From departments
Join employees Using (department_id)
Where hire_date IN (
    Select MIN(hire_date)
    From employees)

1 rows affected.

[('Executive', 'Steven', 'King')]